[
  {
    "field_category": "Team",
    "title": "Dr Sumit D Chowdhury",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXSumit.png",
    "field_designation": "President, Founder",
    "field_descriptions": "<p>Sumit is a serial entrepreneur and seasoned business executive, having held senior roles in global consulting and telecom companies. He has developed several digital network platforms across diverse sectors such as telecom, trade, and regulatory environments. His expertise also extends to the production and distribution of green hydrogen, where he actively engages in key projects. He regularly consults with government bodies on significant policy issues.</p><p>Formerly the President of Reliance Jio, Sumit is the co-founder and Chairman of Gaia and Sesovera Inc., and is currently incubating Hydreen, a green hydrogen production company. He serves as Visiting Faculty at Carnegie Mellon University, specializing in sustainability and smart cities. Sumit has previously held CTO positions at Brookfield Properties India and the Wadhwani Foundation, and has served as an Independent Director and Technology Advisor at BARC. At IBM, he spearheaded the digital transformation of the telecom, energy, and utilities industries in India. His previous roles include Managing Partner at KPMG Consulting/BearingPoint Australia and Partner at KPMG USA. Sumit is also the author of a bestselling book and a sought-after global public speaker on a wide range of topics.</p>"
  },
  {
    "field_category": "Team",
    "title": "Jean-Marie Lamay",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXJean%20Marie_1.png",
    "field_designation": "Chief Product Officer",
    "field_descriptions": "<p>As an accomplished finance professional, Jean-Marie has excelled in diverse roles across global financial hubs, with a specialization in commodity and energy derivatives trading. His career includes experience as an interest rate options trader and structurer, as well as the creation and leadership of a global commodity trade and sales team for a major German bank. He is recognized for his market-making expertise in emerging derivatives, petrochemicals, and container freight.</p><p>Jean-Marie's consulting expertise in container freight and index development further enhances his contributions as a founding member of our platform. His vision is grounded in practical market insights and a deep understanding of commodity trading dynamics. A goal-oriented motivator, Jean-Marie has a proven track record of planning, building, and revitalizing trading, sales, and broker teams.</p>"
  },
  {
    "field_category": "Team",
    "title": "Olaf-Gerd Gemein",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXOlaf_1.png",
    "field_designation": "European Operations",
    "field_descriptions": "<p>Olaf-Gerd Gemein leads the European activities of GreenEarthX. His primary responsibilities encompass business, financials, and contracts. Olaf-Gerd has 39 years of experience in both the public and private sectors. He served as a consultant for the European Commission in various public-private partnership projects, supported the World Bank in projects in Africa and India, and is currently leading several organizations and working groups.</p><p>He holds advisory roles in projects with the City of Kiel, the Open &amp; Agile Smart Cities Initiative, the GreenTEC Campus, and the region of Schleswig-Flensburg. Olaf-Gerd is the co-founder of several organizations, including Impact Funding Europe GmbH, Smart Cities Lab Ltd, Orbiter DataSpace GmbH, truzzt Infrastructure GmbH, and Vero City GmbH. He is also a partner of Eisenschmidt Consulting Crew GmbH.</p>"
  },
  {
    "field_category": "Team",
    "title": "Amrita Chowdhury",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXAmrita.png",
    "field_designation": "Product And Platform Design",
    "field_descriptions": "<p>Amrita Chowdhury, Co-Founder and CEO of Gaia, a pioneering information and analytics SaaS company, is an industry luminary and strategic leader. With a background in innovation and product development at Applied Materials in California, Amrita has held key roles such as President and CEO of DY Works (Future Group) and Country Head South Asia for Harlequin (News Corp). Currently serving on several public and subsidiary boards, including ZF India, Simmonds Marshall, Nesco, and Mahindra Lifespace Developers, Amrita is deeply engaged in industry associations and business councils.</p><p>An accomplished business strategist, engineer, and innovator, Amrita holds a B.Tech. from IIT Kanpur, an MS from UC Berkeley, and an MBA from Carnegie Mellon Tepper Business School. Her passion for content is evident in her two fiction books and frequent commentary on business, technology, and marketing issues in mainstream media. As a thought leader, she has co-authored white papers on e-Governance, Smart Cities, and Design Thinking for prominent entities. Amrita's unique insights and extensive contributions make her an invaluable force in driving digital transformation and innovation.</p>"
  },
  {
    "field_category": "Team",
    "title": "Meher Afroz",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-07/Screenshot%202024-07-25%20at%206.52.15%E2%80%AFPM.png",
    "field_designation": "Chief Technology Officer",
    "field_descriptions": "<p>Meher is a technologist dedicated to leading large-scale business transformations by building robust digital foundations and empowering people with the right tools. With a career marked by impactful roles at Microsoft and General Electric, spanning Seattle and Hyderabad, Meher brings a wealth of leadership and business acumen to the team. Most recently, Meher served as a General Manager at Microsoft India Development Center, where she was responsible for the core platforms for commerce and billing services of Azure and Microsoft 365.</p><p>Throughout her career, Meher has built and scaled global, multi-site, and multicultural engineering organizations that operate internet and cloud-scale services. She has driven growth for Microsoft's enterprise offerings and fostered a culture of inclusivity through Diversity, Equity, and Inclusion efforts.</p><p>Meher is committed to environmental and human sustainability and is a champion of Women in Technology.</p>"
  },
  {
    "field_category": "Team",
    "title": "Stefan Langin",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-12/stefan.jpg",
    "field_designation": "Americas Operations",
    "field_descriptions": "<p>With over two decades of innovative leadership experience, including 10 years focused on the clean tech sector, Stefan Langin serves as the driving force behind GreenEarthX's activities across North and South America.</p><p>In his role leading the company's Americas initiatives, Stefan is renowned for his ability to empower early-stage organizations and guide them towards their next phase of growth. Leveraging his expertise in go-to-market strategies and operational optimization, he has a proven track record of delivering profitable growth and shareholder value in highly competitive markets.</p><p>Stefan's strategic acumen has been instrumental in navigating companies through three recessions, applying that invaluable knowledge to the clean tech industry for the past decade. Previously, he served as Chief Services Officer at the US clean tech company Enervee, where he delivered a remarkable 300% profitability increase. He also led stellar performance as CEO of Ogilvy and Neo@Ogilvy, driving $80M in revenue while overseeing multinational digital professionals across 25 EMEA markets.</p>"
  },
  {
    "field_category": "Team",
    "title": "Martin Henne",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-12/Website%20Bio%20Jay%20Vaidya.jpg",
    "field_designation": "Europe Market Development",
    "field_descriptions": "<p>Martin has successfully built and led several organizations with multi-sector approach. He is experienced in various industries, always seeking for innovations and new trends. New tech was always not only a fascination but more a passion.</p><p>As industrial engineer with holding additionally an MBA his main task was always to transform ideas into operations. In the past years he was passionate about generating solutions for a greener planet to enable future generations to find a planet where it is worth to live on.</p><p>He was the main operator in establishing a hydrogen qualification program to boost this technology. He has international market experience all over the world</p>"
  },
  {
    "field_category": "Team",
    "title": "Dr. Peter Schottes",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXPeter.png",
    "field_designation": "European Operations",
    "field_descriptions": "<p>Peter has a long track record of transforming SMEs, corporates, and public sector organizations into mature and efficient entities that are digitally enabled. He is an experienced strategist, cultural change advisor, speaker, and networker. Peter is actively involved in advancing the hydrogen business, particularly in the renewable energy hotspot of Northern Germany. He holds a PhD in natural science, with a focus on climate impact research.</p><p>Peter began his career as a project manager for software development and a self-employed consultant before joining Eisenschmidt Consulting Crew, where he currently serves as managing director and main shareholder. He is the co-founder and managing director of Impact Funding Europe, a company focused on smart and climate-neutral impact projects. Additionally, he is the co-founder of a hydrogen think tank and is active as a business angel investor.</p>"
  },
  {
    "field_category": "Team",
    "title": "Ajay Arora",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXAjay_1.png",
    "field_designation": "Capital Markets Relationships",
    "field_descriptions": "<p>Ajay Arora brings over 26 years of global capital markets expertise, spanning investment banking, retail sales, asset management, private banking, and multi-family office operations. He has a proven track record in Indian, Middle Eastern, and Asian markets, with diverse multi-asset class exposure. Having held key roles at Kotak Mahindra, IL&amp;FS Investsmart, Deutsche Asset Management, and Mashreq Bank, Ajay spearheaded public issue management, M&amp;A, and capital structuring, pioneering India's first-ever bought-out deal via offer for sale.</p><p>In leadership roles, Ajay drove assets over USD 1 billion and grew asset management AUM to USD 3.5 billion, resulting in his organization being recognized as one of the fastest-growing companies in India. He established a USD 1.8 billion private banking platform and a multi-family office with a fourfold exit value. A Chartered Accountant and management postgraduate, Ajay holds business and marketing diplomas from Ross Business School, Michigan, and is certified by the Chartered Institute for Securities &amp; Investment. Ajay Arora's global impact underscores his exceptional financial acumen and strategic leadership.</p>"
  },
  {
    "field_category": "Advisors",
    "title": "Venky Mahadevan",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXVenky.png",
    "field_designation": "Platform Consultant (Beckn)",
    "field_descriptions": "<p>Venky is an advocate for a decentralized and open system that democratizes digital commerce at its core. He began his journey with HumbhiOnline, establishing the backbone of the product on the Beckn protocol. As a pioneer in building open-source platforms on the Beckn protocol, Venky's innovations will form the core of the GEX trading platform.</p>"
  },
  {
    "field_category": "Advisors",
    "title": "Manoj Kohli",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXManoj_1.png",
    "field_designation": "Advisor",
    "field_descriptions": "<p>Manoj is the Chairperson of Masters Union, a technology-focused business school near New Delhi. He previously served as the Country Head of Softbank India and the MD and CEO of Bharti Airtel, which he grew into one of the largest telecommunications companies in the world. Manoj is also a board member of OLA, Axis Bank, and several other companies.</p>"
  },
  {
    "field_category": "Advisors",
    "title": "Florian Kolb",
    "field_image": "https://greenearthx.com/web/sites/default/files/2024-02/GEXFlorian.png",
    "field_designation": "Advisor",
    "field_descriptions": "<p>Florian is the Chief Commercial Officer and GM Energy at Intertrust. He has extensive professional experience in the global energy and Silicon Valley tech industries, having held key roles at RWE AG, Innogy SE, and E.ON SE. His core expertise includes scaling digital, data, and security innovations, strategic corporate venture investments, mergers and acquisitions (M&amp;A), and restructuring.</p>"
  },
  {
    "field_category": "Team",
    "title": "Marwen Chaabouni",
    "field_image": "",
    "field_designation": "Energetic Engineer",
    "field_descriptions": ""
  },
  {
    "field_category": "Team",
    "title": "Mohamed Ben Kedim",
    "field_image": "",
    "field_designation": "Software Engineer",
    "field_descriptions": ""
  },
  {
    "field_category": "Team",
    "title": "Maryem Hadj Wannes",
    "field_image": "",
    "field_designation": "Software Engineer",
    "field_descriptions": ""
  }
]
